# Import Modules

In [5]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Dataframe

In [7]:
n_rows = 5
n_cols = 5 
cols = tuple( 'ABCDE' )
df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                        columns=cols)
df

   A  B  C  D  E
0  3  5  4  8  4
1  4  4  2  9  9
2  9  8  1  5  6
3  1  7  3  1  9
4  1  3  4  7  2

# Membalik Urutan Kolom

In [9]:
df.loc[:, ::-1]

   E  D  C  B  A
0  4  8  4  5  3
1  9  9  2  4  4
2  6  5  1  8  9
3  9  1  3  7  1
4  2  7  4  3  1

# Membalik Urutan Baris

In [11]:
df.loc[::-1]

   A  B  C  D  E
4  1  3  4  7  2
3  1  7  3  1  9
2  9  8  1  5  6
1  4  4  2  9  9
0  3  5  4  8  4

# Membalik urutan baris dan melakukan penyesuaian ulang index

In [13]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  1  3  4  7  2
1  1  7  3  1  9
2  9  8  1  5  6
3  4  4  2  9  9
4  3  5  4  8  4